{
  "meta": {
    "source": "CEFR Companion Volume (2020) – Council of Europe",
    "file": "CEFR_Descriptors_2020.xlsx",
    "note": "Curated scales for lesson generation. Full Excel in public/data/CEFR_Descriptors_2020.xlsx"
  },
  "scales": [
    {
      "id": "oral-comprehension",
      "category": "Communicative language activities",
      "mode": "Reception",
      "activity": "Oral comprehension",
      "scale": "Overall oral comprehension",
      "skill": "listening",
      "descriptors": {
        "A1": "Can follow language which is very slow and carefully articulated, with long pauses for them to assimilate meaning.",
        "A2": "Can understand phrases and expressions related to areas of most immediate priority (e.g. very basic personal and family information, shopping, local geography, employment), provided people articulate clearly and slowly.",
        "B1": "Can understand the main points made in clear standard language on familiar matters regularly encountered at work, school, leisure, etc., including short narratives.",
        "B2": "Can understand the main ideas of propositionally and linguistically complex discourse on both concrete and abstract topics delivered in standard language.",
        "C1": "Can understand enough to follow extended discourse on abstract and complex topics beyond their own field, though they may need to confirm occasional details.",
        "C2": "Can understand with ease virtually any kind of language, whether live or broadcast, delivered at fast natural speed."
      }
    },
    {
      "id": "understanding-conversation",
      "category": "Communicative language activities",
      "mode": "Reception",
      "activity": "Oral comprehension",
      "scale": "Understanding conversation between other people",
      "skill": "listening",
      "descriptors": {
        "A1": "Can understand words and short sentences in a simple conversation, provided people communicate very slowly and very clearly.",
        "A2": "Can follow in outline short, simple social exchanges, conducted very slowly and clearly.",
        "B1": "Can generally follow the main points of extended discussion around them, provided it is clearly articulated in standard language.",
        "B2": "Can with some effort catch much of what is said around them in discussion.",
        "C1": "Can easily follow complex interactions between third parties in group discussion and debate, even on abstract, complex, unfamiliar topics.",
        "C2": "Can identify the sociocultural implications of most of the language used in colloquial discussions."
      }
    },
    {
      "id": "understanding-announcements",
      "category": "Communicative language activities",
      "mode": "Reception",
      "activity": "Oral comprehension",
      "scale": "Understanding announcements and instructions",
      "skill": "listening",
      "descriptors": {
        "A1": "Can understand instructions addressed carefully and slowly to them and follow short, simple directions.",
        "A2": "Can catch the main point in short, clear, simple messages and announcements.",
        "B1": "Can understand simple technical information, such as operating instructions for everyday equipment.",
        "B2": "Can understand announcements and messages on concrete and abstract topics delivered in standard language at normal speed.",
        "C1": "Can extract specific information from poor quality, distorted public announcements.",
        "C2": "No descriptors available; see C1."
      }
    },
    {
      "id": "overall-reading",
      "category": "Communicative language activities",
      "mode": "Reception",
      "activity": "Reading comprehension",
      "scale": "Overall reading comprehension",
      "skill": "reading",
      "descriptors": {
        "A1": "Can understand very short, simple texts a single phrase at a time, picking up familiar names, words and basic phrases and rereading as required.",
        "A2": "Can understand short, simple texts containing the highest frequency vocabulary, including a proportion of shared international vocabulary items.",
        "B1": "Can read straightforward factual texts on subjects related to their field of interest with a satisfactory level of comprehension.",
        "B2": "Can read with a large degree of independence, adapting style and speed of reading to different texts and purposes.",
        "C1": "Can understand in detail lengthy, complex texts, whether or not these relate to their own area of speciality.",
        "C2": "Can understand virtually all types of texts including abstract, structurally complex, or highly colloquial literary and non-literary writings."
      }
    },
    {
      "id": "reading-correspondence",
      "category": "Communicative language activities",
      "mode": "Reception",
      "activity": "Reading comprehension",
      "scale": "Reading correspondence",
      "skill": "reading",
      "descriptors": {
        "A1": "Can understand short, simple messages on postcards and short messages sent via social media.",
        "A2": "Can understand short, simple personal letters and very simple formal e-mails.",
        "B1": "Can understand the description of events, feelings and wishes in personal letters well enough to correspond regularly.",
        "B2": "Can read correspondence relating to their field of interest and readily grasp the essential meaning.",
        "C1": "Can understand any correspondence given the occasional use of a dictionary.",
        "C2": "Can understand specialised, formal correspondence on a complex topic."
      }
    },
    {
      "id": "reading-information",
      "category": "Communicative language activities",
      "mode": "Reception",
      "activity": "Reading comprehension",
      "scale": "Reading for information and argument",
      "skill": "reading",
      "descriptors": {
        "A1": "Can get an idea of the content of simpler informational material and short, simple descriptions, especially if there is visual support.",
        "A2": "Can understand texts describing people, places, everyday life and culture, provided they use simple language.",
        "B1": "Can recognise significant points in straightforward news articles on familiar subjects.",
        "B2": "Can understand articles and reports concerned with contemporary problems in which particular stances or viewpoints are adopted.",
        "C1": "Can understand in detail a wide range of lengthy, complex texts likely to be encountered in social, professional or academic life.",
        "C2": "Can understand the finer points and implications of a complex report or article even outside their area of specialisation."
      }
    },
    {
      "id": "reading-instructions",
      "category": "Communicative language activities",
      "mode": "Reception",
      "activity": "Reading comprehension",
      "scale": "Reading instructions",
      "skill": "reading",
      "descriptors": {
        "A1": "Can follow short, simple written directions (e.g. to go from X to Y).",
        "A2": "Can understand regulations, for example safety, when expressed in simple language.",
        "B1": "Can understand clearly written, straightforward instructions for a piece of equipment.",
        "B2": "Can understand lengthy, complex instructions in their field, including details on conditions and warnings.",
        "C1": "Can understand in detail lengthy, complex instructions on a new machine or procedure.",
        "C2": "No descriptors available; see C1."
      }
    },
    {
      "id": "overall-oral-production",
      "category": "Communicative language activities",
      "mode": "Production",
      "activity": "Oral production",
      "scale": "Overall oral production",
      "skill": "speaking",
      "descriptors": {
        "A1": "Can produce simple, mainly isolated phrases about people and places.",
        "A2": "Can give a simple description or presentation of people, living or working conditions, daily routines, likes/dislikes.",
        "B1": "Can reasonably fluently sustain a straightforward description of one of a variety of subjects within their field of interest.",
        "B2": "Can give clear, detailed descriptions and presentations on a wide range of subjects related to their field of interest.",
        "C1": "Can give clear, detailed descriptions and presentations on complex subjects, integrating sub-themes and rounding off with an appropriate conclusion.",
        "C2": "Can produce clear, smoothly flowing, well-structured discourse with an effective logical structure."
      }
    },
    {
      "id": "describing-experience",
      "category": "Communicative language activities",
      "mode": "Production",
      "activity": "Oral production",
      "scale": "Sustained monologue: describing experience",
      "skill": "speaking",
      "descriptors": {
        "A1": "Can describe themselves, what they do and where they live.",
        "A2": "Can describe their family, living conditions, educational background, present or most recent job.",
        "B1": "Can give straightforward descriptions on a variety of familiar subjects within their field of interest.",
        "B2": "Can give clear, detailed descriptions on a wide range of subjects related to their field of interest.",
        "C1": "Can give clear, detailed descriptions of complex subjects, integrating sub-themes and rounding off with an appropriate conclusion.",
        "C2": "Can give clear, smoothly flowing, elaborate and often memorable descriptions."
      }
    },
    {
      "id": "overall-written-production",
      "category": "Communicative language activities",
      "mode": "Production",
      "activity": "Written production",
      "scale": "Overall written production",
      "skill": "writing",
      "descriptors": {
        "A1": "Can write simple isolated phrases and sentences.",
        "A2": "Can write a series of simple phrases and sentences linked with simple connectors like 'and', 'but' and 'because'.",
        "B1": "Can write straightforward connected texts on a range of familiar subjects within their field of interest.",
        "B2": "Can write clear, detailed texts on a variety of subjects related to their field of interest, synthesising and evaluating information.",
        "C1": "Can write clear, well-structured texts of complex subjects, underlining the relevant salient issues, expanding and supporting points of view.",
        "C2": "Can write clear, smoothly flowing, complex texts in an appropriate and effective style."
      }
    },
    {
      "id": "creative-writing",
      "category": "Communicative language activities",
      "mode": "Production",
      "activity": "Written production",
      "scale": "Creative writing",
      "skill": "writing",
      "descriptors": {
        "A1": "Can write simple phrases and sentences about themselves and imaginary people, where they live and what they do.",
        "A2": "Can write about everyday aspects of their environment in linked sentences.",
        "B1": "Can write straightforward, detailed descriptions on a range of familiar subjects within their field of interest.",
        "B2": "Can write clear, detailed descriptions of real or imaginary events and experiences.",
        "C1": "Can write clear, detailed, well-structured and developed descriptions and imaginative texts in an assured, personal, natural style.",
        "C2": "Can write clear, smoothly flowing, and fully engrossing stories and descriptions of experience in a style appropriate to the genre adopted."
      }
    },
    {
      "id": "overall-oral-interaction",
      "category": "Communicative language activities",
      "mode": "Interaction",
      "activity": "Oral interaction",
      "scale": "Overall oral interaction",
      "skill": "speaking",
      "descriptors": {
        "A1": "Can interact in a simple way but communication is totally dependent on repetition at a slower rate, rephrasing and repair.",
        "A2": "Can communicate in simple and routine tasks requiring a simple and direct exchange of information on familiar and routine matters.",
        "B1": "Can exploit a wide range of simple language to deal with most situations likely to arise whilst travelling.",
        "B2": "Can interact with a degree of fluency and spontaneity that makes regular interaction, and sustained relationships, quite possible.",
        "C1": "Can express themselves fluently and spontaneously, almost effortlessly.",
        "C2": "Has a good command of idiomatic expressions and colloquialisms with awareness of connotative levels of meaning."
      }
    },
    {
      "id": "conversation",
      "category": "Communicative language activities",
      "mode": "Interaction",
      "activity": "Oral interaction",
      "scale": "Conversation",
      "skill": "speaking",
      "descriptors": {
        "A1": "Can take part in a simple conversation of a basic factual nature on a predictable topic.",
        "A2": "Can handle very short social exchanges but is rarely able to understand enough to keep conversation going of their own accord.",
        "B1": "Can enter unprepared into conversations on familiar topics.",
        "B2": "Can engage in extended conversation on most general topics in a clearly participatory fashion.",
        "C1": "Can use language flexibly and effectively for social purposes, including emotional, allusive and joking usage.",
        "C2": "Can converse comfortably and appropriately, unhampered by any linguistic limitations."
      }
    },
    {
      "id": "informal-discussion",
      "category": "Communicative language activities",
      "mode": "Interaction",
      "activity": "Oral interaction",
      "scale": "Informal discussion (with friends)",
      "skill": "speaking",
      "descriptors": {
        "A1": "No descriptors available.",
        "A2": "Can discuss what to do, where to go and make arrangements to meet.",
        "B1": "Can generally follow the main points in an informal discussion with friends.",
        "B2": "Can take an active part in informal discussion in familiar contexts, commenting and putting a point of view clearly.",
        "C1": "Can easily follow and contribute to complex interactions between third parties in group discussion.",
        "C2": "Can advise on or discuss sensitive issues without awkwardness."
      }
    },
    {
      "id": "goal-oriented-cooperation",
      "category": "Communicative language activities",
      "mode": "Interaction",
      "activity": "Oral interaction",
      "scale": "Goal-oriented co-operation",
      "skill": "speaking",
      "descriptors": {
        "A1": "Can understand questions and instructions addressed carefully and slowly to them and follow short, simple directions.",
        "A2": "Can understand enough to manage simple, routine tasks without undue effort.",
        "B1": "Can follow what is being said, though they may occasionally have to ask for repetition if the other people's contributions are rapid.",
        "B2": "Can understand detailed instructions reliably.",
        "C1": "Can relate their own contribution skilfully to those of other speakers.",
        "C2": "No descriptors available; see C1."
      }
    },
    {
      "id": "transactions",
      "category": "Communicative language activities",
      "mode": "Interaction",
      "activity": "Oral interaction",
      "scale": "Transactions to obtain goods and services",
      "skill": "speaking",
      "descriptors": {
        "A1": "Can ask people for things and give people things.",
        "A2": "Can ask for and provide everyday goods and services.",
        "B1": "Can deal with most transactions likely to arise whilst travelling, arranging travel or accommodation.",
        "B2": "Can cope linguistically to negotiate a solution to a dispute like an undeserved fine.",
        "C1": "Can express themselves with clarity and precision, using language flexibly and effectively.",
        "C2": "No descriptors available; see C1."
      }
    },
    {
      "id": "information-exchange",
      "category": "Communicative language activities",
      "mode": "Interaction",
      "activity": "Oral interaction",
      "scale": "Information exchange",
      "skill": "speaking",
      "descriptors": {
        "A1": "Can understand questions and instructions addressed carefully and slowly and follow short, simple directions.",
        "A2": "Can communicate in simple and routine tasks using simple phrases to ask for and provide things.",
        "B1": "Can exchange, check and confirm accumulated factual information on familiar routine and non-routine matters.",
        "B2": "Can understand and exchange complex information and advice on the full range of matters related to their occupational role.",
        "C1": "Can easily follow and contribute to complex interactions between third parties in group discussion.",
        "C2": "No descriptors available; see C1."
      }
    },
    {
      "id": "overall-written-interaction",
      "category": "Communicative language activities",
      "mode": "Interaction",
      "activity": "Written interaction",
      "scale": "Overall written interaction",
      "skill": "writing",
      "descriptors": {
        "A1": "Can ask for or pass on personal details in written form.",
        "A2": "Can write short, simple formulaic notes relating to matters of immediate need.",
        "B1": "Can convey information and ideas on abstract as well as concrete topics, check information, and ask about or explain problems with reasonable precision.",
        "B2": "Can express news and views effectively in writing, and relate to those of others.",
        "C1": "Can express themselves with clarity and precision, relating to the addressee flexibly and effectively.",
        "C2": "No descriptors available; see C1."
      }
    },
    {
      "id": "vocabulary-range",
      "category": "Communicative language competences",
      "mode": "Linguistic",
      "activity": "Linguistic competence",
      "scale": "General linguistic range / Vocabulary range",
      "skill": "vocabulary",
      "descriptors": {
        "A1": "Has a very basic range of simple expressions about personal details and needs of a concrete type.",
        "A2": "Has sufficient vocabulary for the expression of basic communicative needs and for coping with simple survival needs.",
        "B1": "Has a sufficient vocabulary to express themselves with some circumlocutions on most topics pertinent to everyday life.",
        "B2": "Has a good range of vocabulary for matters connected to their field and most general topics.",
        "C1": "Has a good command of a broad lexical repertoire allowing gaps to be readily overcome with circumlocutions.",
        "C2": "Has a good command of a very broad lexical repertoire including idiomatic expressions and colloquialisms."
      }
    },
    {
      "id": "vocabulary-control",
      "category": "Communicative language competences",
      "mode": "Linguistic",
      "activity": "Linguistic competence",
      "scale": "Vocabulary control",
      "skill": "vocabulary",
      "descriptors": {
        "A1": "No descriptors available.",
        "A2": "Can control a narrow repertoire dealing with concrete everyday needs.",
        "B1": "Shows good control of elementary vocabulary but major errors still occur when expressing more complex thoughts.",
        "B2": "Lexical accuracy is generally high, though some confusion and incorrect word choice does occur without hindering communication.",
        "C1": "Occasional minor slips, but no significant vocabulary errors.",
        "C2": "Consistently correct and appropriate use of vocabulary."
      }
    },
    {
      "id": "grammatical-accuracy",
      "category": "Communicative language competences",
      "mode": "Linguistic",
      "activity": "Linguistic competence",
      "scale": "Grammatical accuracy",
      "skill": "grammar",
      "descriptors": {
        "A1": "Shows only limited control of a few simple grammatical structures and sentence patterns in a learnt repertoire.",
        "A2": "Uses some simple structures correctly, but still systematically makes basic mistakes.",
        "B1": "Communicates with reasonable accuracy in familiar contexts; generally good control though with noticeable mother tongue influence.",
        "B2": "Shows a relatively high degree of grammatical control. Does not make mistakes which lead to misunderstanding.",
        "C1": "Consistently maintains a high degree of grammatical accuracy; errors are rare and difficult to spot.",
        "C2": "Maintains consistent grammatical control of complex language, even while attention is otherwise engaged."
      }
    },
    {
      "id": "phonological-control",
      "category": "Communicative language competences",
      "mode": "Linguistic",
      "activity": "Linguistic competence",
      "scale": "Phonological control",
      "skill": "speaking",
      "descriptors": {
        "A1": "Pronunciation of a very limited repertoire of learnt words and phrases can be understood with some effort by interlocutors used to dealing with speakers of the language group.",
        "A2": "Pronunciation is generally clear enough to be understood, but conversational partners will need to ask for repetition from time to time.",
        "B1": "Pronunciation is clearly intelligible even if a foreign accent is sometimes evident and occasional mispronunciations occur.",
        "B2": "Has acquired a clear, natural pronunciation and intonation.",
        "C1": "Can vary intonation and place sentence stress correctly in order to express finer shades of meaning.",
        "C2": "Can articulate virtually all of the sounds of the target language with clarity and precision."
      }
    },
    {
      "id": "orthographic-control",
      "category": "Communicative language competences",
      "mode": "Linguistic",
      "activity": "Linguistic competence",
      "scale": "Orthographic control",
      "skill": "writing",
      "descriptors": {
        "A1": "Can copy familiar words and short phrases, e.g. simple signs or instructions, names of everyday objects, names of shops.",
        "A2": "Can copy short sentences on everyday subjects. Can write with reasonable phonetic accuracy short words that are in their oral vocabulary.",
        "B1": "Can produce continuous writing which is generally intelligible throughout. Spelling, punctuation and layout are accurate enough to be followed most of the time.",
        "B2": "Can produce clearly intelligible continuous writing which follows standard layout and paragraphing conventions.",
        "C1": "Layout, paragraphing and punctuation are consistent and helpful. Spelling is accurate, apart from occasional slips.",
        "C2": "Writing is orthographically free of error."
      }
    },
    {
      "id": "sociolinguistic-appropriateness",
      "category": "Communicative language competences",
      "mode": "Sociolinguistic",
      "activity": "Sociolinguistic competence",
      "scale": "Sociolinguistic appropriateness",
      "skill": "speaking",
      "descriptors": {
        "A1": "Can establish basic social contact by using the simplest everyday polite forms of greetings and farewells; introductions; saying please, thank you, sorry, etc.",
        "A2": "Can handle very short social exchanges, using everyday polite forms of greeting and address.",
        "B1": "Can perform and respond to a wide range of language functions, using their most common exponents in a neutral register.",
        "B2": "Can express themselves confidently, clearly and politely in a formal or informal register, appropriate to the situation.",
        "C1": "Can recognise a wide range of idiomatic expressions and colloquialisms, appreciating register shifts.",
        "C2": "Has a good command of idiomatic expressions and colloquialisms with awareness of connotative levels of meaning."
      }
    },
    {
      "id": "flexibility",
      "category": "Communicative language competences",
      "mode": "Pragmatic",
      "activity": "Pragmatic competence",
      "scale": "Flexibility",
      "skill": "speaking",
      "descriptors": {
        "A1": "No descriptors available.",
        "A2": "Can adapt well-rehearsed memorised simple phrases to particular circumstances through limited lexical substitution.",
        "B1": "Can adapt their expression to deal with less routine, even difficult situations.",
        "B2": "Can adjust what they say and the means of expressing it to the situation and the recipient and adopt a level of formality appropriate to the circumstances.",
        "C1": "Can modify their expression to express degrees of commitment or to highlight the focus of their communication.",
        "C2": "Shows great flexibility reformulating ideas in differing linguistic forms to give emphasis, differentiate or to eliminate ambiguity."
      }
    },
    {
      "id": "coherence-cohesion",
      "category": "Communicative language competences",
      "mode": "Pragmatic",
      "activity": "Pragmatic competence",
      "scale": "Coherence and cohesion",
      "skill": "writing",
      "descriptors": {
        "A1": "Can link words or groups of words with very basic linear connectors like 'and' or 'then'.",
        "A2": "Can link groups of words with simple connectors like 'and', 'but' and 'because'.",
        "B1": "Can link a series of shorter, discrete simple elements into a connected, linear sequence of points.",
        "B2": "Can use a variety of linking words efficiently to mark clearly the relationships between ideas.",
        "C1": "Can produce clear, smoothly flowing, well-structured text, showing controlled use of organisational patterns, connectors and cohesive devices.",
        "C2": "Can create coherent and cohesive text making full and appropriate use of a variety of organisational patterns."
      }
    }
  ]
}
